src/test/resources/mockdata/batchVouchers/35657479-83b9-4760-9c39-b58dcd02ee14.json

{
  "id": "35657479-83b9-4760-9c39-b58dcd02ee14",
  "batchGroup": "Amherst College (AC)",
  "start": "2019-12-06T00:00:00.000+0000",
  "end": "2019-12-07T00:00:00.000+0000",
  "created": "2019-12-07T00:01:04.000+0000",
  "batchedVouchers": [
    {
      "accountingCode": "0206",
      "accountNo": "111111-74837",
      "amount": 23.45,
      "disbursementNumber": "EFT546789",
      "disbursementDate": "2019-12-06T00:01:04.000+0000",
      "disbursementAmount": 23.45,
      "enclosureNeeded": true,
      "exchangeRate": 1,
      "folioInvoiceNo": "123invoicenumber45",
      "invoiceCurrency": "USD",
      "invoiceDate": "2019-12-05T00:00:00.000+0000",
      "invoiceTerms": "Payment in Advance",
      "invoiceNote": "Process immediately",
      "status": "Paid",
      "systemCurrency": "USD",
      "type": "Voucher",
      "voucherDate": "2019-12-06T00:00:00.000+0000",
      "voucherNumber": "1023",
      "vendorName": "GOBI",
      "vendorAddress": {
        "addressLine1": "10 Estes Street",
        "city": "Ipswich",
        "stateRegion": "MA",
        "zipCode": "01938",
        "country": "USA"

      },
      "vendorInvoiceNo": "YK75851",
      "adjustments": [
        {
          "description": "Test",
          "exportToAccounting": true,
          "type": "Amount",
          "value": 4.50,
          "totalAmount": 4.50,
          "prorate": "By line",
          "relationToTotal": "In addition to"
        }
      ],
      "batchedVoucherLines": [
        {
          "amount": 23.45,
          "externalAccountNumber": "54321098",
          "fundCodes": [ "HIST", "LATHIST", "CANHIST" ]
        }
      ]
    }
  ],
  "totalRecords": 1
}
